thorrak/brewpi-esp8266/src/PiLink.cpp
void PiLink::jsonOutputUint8(const char* key, uint8_t offset) {
	piLink.sendJsonPair(key, *(jsonOutputBase+offset));
}

void PiLink::jsonOutputUint16(const char* key, uint8_t offset) {
	piLink.sendJsonPair(key, *((uint16_t*) (jsonOutputBase+offset)));
}

/**
 * Outputs the temperature at the given offset from TempControl.
 * The temperature is assumed to be an internal fixed point value.
 */
void PiLink::jsonOutputTempToString(const char* key,  uint8_t offset) {
	char buf[12];
	piLink.sendJsonPair(key, tempToString(buf, *((temperature*)(jsonOutputBase+offset)), 1, 12));
}

void PiLink::jsonOutputFixedPointToString(const char* key, uint8_t offset) {
	char buf[12];
	piLink.sendJsonPair(key, fixedPointToString(buf, *((temperature*)(jsonOutputBase+offset)), 3, 12));
}

void PiLink::jsonOutputTempDiffToString(const char* key, uint8_t offset) {
	char buf[12];
	piLink.sendJsonPair(key, tempDiffToString(buf, *((temperature*)(jsonOutputBase+offset)), 3, 12));
}

void PiLink::jsonOutputChar(const char* key, uint8_t offset) {
	piLink.sendJsonPair(key, *((char*)(jsonOutputBase+offset)));
}

typedef void (*JsonOutputCCHandler)(const char* key, uint8_t offset);

enum JsonOutputIndex {
	JOCC_UINT8=0,
	JOCC_TEMP_FORMAT=1,
	JOCC_FIXED_POINT=2,
	JOCC_TEMP_DIFF=3,
	JOCC_CHAR=4,
	JOCC_UINT16=5,
};

/**
 * List of configured JsonOutputHandler functions
 */
const PiLink::JsonOutputHandler PiLink::JsonOutputHandlers[] = {
	PiLink::jsonOutputUint8,
	PiLink::jsonOutputTempToString,
	PiLink::jsonOutputFixedPointToString,
	PiLink::jsonOutputTempDiffToString,
	PiLink::jsonOutputChar,
	PiLink::jsonOutputUint16,
};

#define JSON_OUTPUT_CC_MAP(name, fn) { JSONKEY_ ## name,  offsetof(ControlConstants, name), fn }
#define JSON_OUTPUT_CV_MAP(name, fn) { JSONKEY_ ## name,  offsetof(ControlVariables, name), fn }
#define JSON_OUTPUT_CS_MAP(name, fn) { JSONKEY_ ## name,  offsetof(ControlSettings, name), fn }

const PiLink::JsonOutput PiLink::jsonOutputCCMap[] PROGMEM = {
	JSON_OUTPUT_CC_MAP(tempFormat, JOCC_CHAR),
	JSON_OUTPUT_CC_MAP(tempSettingMin, JOCC_TEMP_FORMAT),
	JSON_OUTPUT_CC_MAP(tempSettingMax, JOCC_TEMP_FORMAT),
	JSON_OUTPUT_CC_MAP(pidMax, JOCC_TEMP_DIFF),

	JSON_OUTPUT_CC_MAP(Kp, JOCC_FIXED_POINT),
	JSON_OUTPUT_CC_MAP(Ki, JOCC_FIXED_POINT),
	JSON_OUTPUT_CC_MAP(Kd, JOCC_FIXED_POINT),

	JSON_OUTPUT_CC_MAP(iMaxError, JOCC_TEMP_DIFF),
	JSON_OUTPUT_CC_MAP(idleRangeHigh, JOCC_TEMP_DIFF),
	JSON_OUTPUT_CC_MAP(idleRangeLow, JOCC_TEMP_DIFF),
	JSON_OUTPUT_CC_MAP(heatingTargetUpper, JOCC_TEMP_DIFF),
	JSON_OUTPUT_CC_MAP(heatingTargetLower, JOCC_TEMP_DIFF),
	JSON_OUTPUT_CC_MAP(coolingTargetUpper, JOCC_TEMP_DIFF),
	JSON_OUTPUT_CC_MAP(coolingTargetLower, JOCC_TEMP_DIFF),
	JSON_OUTPUT_CC_MAP(maxHeatTimeForEstimate, JOCC_UINT16),
	JSON_OUTPUT_CC_MAP(maxCoolTimeForEstimate, JOCC_UINT16),

	JSON_OUTPUT_CC_MAP(fridgeFastFilter, JOCC_UINT8),
	JSON_OUTPUT_CC_MAP(fridgeSlowFilter, JOCC_UINT8),
	JSON_OUTPUT_CC_MAP(fridgeSlopeFilter, JOCC_UINT8),
	JSON_OUTPUT_CC_MAP(beerFastFilter, JOCC_UINT8),
	JSON_OUTPUT_CC_MAP(beerSlowFilter, JOCC_UINT8),
	JSON_OUTPUT_CC_MAP(beerSlopeFilter, JOCC_UINT8),
	
	JSON_OUTPUT_CC_MAP(lightAsHeater, JOCC_UINT8),
	JSON_OUTPUT_CC_MAP(rotaryHalfSteps, JOCC_UINT8)
	
};

void PiLink::sendJsonValues(char responseType, const JsonOutput* /*PROGMEM*/ jsonOutputMap, uint8_t mapCount) {
	printResponse(responseType);
	while (mapCount-->0) {
		JsonOutput output;
		memcpy_P(&output, jsonOutputMap++, sizeof(output));
		JsonOutputHandlers[output.handlerOffset](output.key,output.offset);
	}
	sendJsonClose();
}

//struct CustomWriter {
//    // We have to cleanse everything through a CustomWriter class to get it to work as expected
//    static size_t write(uint8_t c) {piLink.write(c);}
//    static size_t write(const uint8_t *buffer, size_t length) {piLink.write(buffer, length);}
//};
//
//void PiLink::sendJsonValuesAJ(char responseType, const DynamicJsonDocument& json_doc) {
//    CustomWriter writer;
//    // Leverage the ArduinoJson support to format/print our JSON values
//    printResponse(responseType);
//    serializeJson(json_doc, writer);
//}

/**
 * \brief Send control constants as JSON string.
 * Might contain spaces between minus sign and number. Python will have to strip these
 */
void PiLink::sendControlConstants(){
//    sendJsonValuesAJ('C', tempControl.cc.toJson());
    // TODO - Convert this to use ArduinoJSON functions rather than sendJsonValues
	jsonOutputBase = (uint8_t*)&tempControl.cc;
	sendJsonValues('C', jsonOutputCCMap, sizeof(jsonOutputCCMap)/sizeof(jsonOutputCCMap[0]));
}

const PiLink::JsonOutput PiLink::jsonOutputCVMap[] PROGMEM = {
	JSON_OUTPUT_CV_MAP(beerDiff, JOCC_TEMP_DIFF),
	JSON_OUTPUT_CV_MAP(diffIntegral, JOCC_TEMP_DIFF),
	JSON_OUTPUT_CV_MAP(beerSlope, JOCC_TEMP_DIFF),
	JSON_OUTPUT_CV_MAP(p, JOCC_FIXED_POINT),
	JSON_OUTPUT_CV_MAP(i, JOCC_FIXED_POINT),
	JSON_OUTPUT_CV_MAP(d, JOCC_FIXED_POINT),
	JSON_OUTPUT_CV_MAP(estimatedPeak, JOCC_TEMP_FORMAT),
	JSON_OUTPUT_CV_MAP(negPeakEstimate, JOCC_TEMP_FORMAT),
	JSON_OUTPUT_CV_MAP(posPeakEstimate, JOCC_TEMP_FORMAT),
	JSON_OUTPUT_CV_MAP(negPeak, JOCC_TEMP_FORMAT),
	JSON_OUTPUT_CV_MAP(posPeak, JOCC_TEMP_FORMAT)
};

/**
 * Send all control variables. Useful for debugging and choosing parameters
 */
void PiLink::sendControlVariables(void){
	jsonOutputBase = (uint8_t*)&tempControl.cv;
	sendJsonValues('V', jsonOutputCVMap, sizeof(jsonOutputCVMap)/sizeof(jsonOutputCVMap[0]));
}

/**
 * \brief Prints the name part of a JSON name/value pair
 * The name must exist in PROGMEM
 * @param name - Key name
 */
void PiLink::printJsonName(const char * name)
{
	printJsonSeparator();
	print('"');
	print_P(name);
	print("\":");
}

/**
 * Send a JSON seperator.
 * The first call will emit a `{`, subsequent calls will emit `,`.
 */
inline void PiLink::printJsonSeparator() {
	print(firstPair ? '{' : ',');
	firstPair = false;
}

/**
 * Send a JSON key/value pair
 */
void PiLink::sendJsonPair(const char * name, const char * val){
	printJsonName(name);
	// TODO - Fix this to use PiLink.print in all cases
#if !defined(ESP8266) && !defined(ESP32)
	piStream.print(val);
#else
	print_P(val);
#endif
}

/**
 * Send a JSON key/value pair
 */
void PiLink::sendJsonPair(const char * name, char val){
	printJsonName(name);
	print('"');
	print(val);
	print('"');
}

/**
 * Send a JSON key/value pair
 */
void PiLink::sendJsonPair(const char * name, uint16_t val){
	printJsonName(name);
	print_P(PSTR("%u"), val);
}


/**
 * Send a JSON key/value pair
 */
void PiLink::sendJsonPair(const char * name, uint8_t val) {
	sendJsonPair(name, (uint16_t)val);
}


/**
 * Read data from the PiLink connection.
 * Uses PiLink::read(), but offers some delay & retry logic.
 */
int readNext()
{
	uint8_t retries = 0;
	while (piStream.available()==0) {
#if defined(ESP8266) || defined(ESP32)
		// changing to delay as delayMicroseconds doesn't yield like delay does
		delay(1);
		yield();
#else
		_delay_us(100);
#endif
		retries++;
		if (retries >= 10) {
			return -1;
		}
	}
	return piLink.read();
}


/**
 * Parses a token from the piStream.
 *
 * Because this is used for both key & values, JSON values are subject to the same limitations as keys.
 * - All whitespace is stripped
 * - Double quotes are stripped
 * - Parsing is stopped at either a `,` or `:`
 *
 * @return true if a token was parsed
 */
bool parseJsonToken(char* val) {
	uint8_t index = 0;
	val[0] = 0;
	bool result = true;
	for(;;) // get value
	{
		int character = readNext();
		if (index==29 || character == '}' || character==-1) {
			result = false;
			break;
		}
		if(character == ',' || character==':')  // end of value
			break;		
		if(character == ' ' || character == '"'){
			; // skip spaces and apostrophes
		}		
		else
			val[index++] = character;
	}
	val[index]=0; // null terminate string
	return result;	
}

/**
 * Basic JSON parsing.
 *
 * @param fn - ParseJsonCallback function pointer which is called for each key/value pair.
 */
void PiLink::parseJson(ParseJsonCallback fn, void* data) 
{
	char key[30];
	char val[30];
	*key = 0;
	*val = 0;
	bool next = true;
	// read first open brace	
	int c = readNext();		
	if (c!='{')
	{
		logErrorInt(ERROR_EXPECTED_BRACKET, c);
		return;
	}
	do {
		next = parseJsonToken(key) && parseJsonToken(val);
		if (val[0] && key[0])
			fn(key, val, data);
	} while (next);
}


/**
 * Process incoming settings JSON
 *
 * @see processJsonPair
 */
void PiLink::receiveJson(void){
	parseJson(&processJsonPair, NULL);

#if !BREWPI_SIMULATE	// this is quite an overhead and not needed for the simulator
	sendControlSettings();	// update script with new settings
	sendControlConstants();
#endif
	return;
}

// Everything dies when these are PROGMEM. Reverting...
//static const char STR_WEB_INTERFACE[] PROGMEM = "in web interface";
//static const char STR_TEMPERATURE_PROFILE[] PROGMEM = "by temperature profile";
//static const char STR_MODE[] PROGMEM = "Mode";
//static const char STR_BEER_TEMP[] PROGMEM = "Beer temp";
//static const char STR_FRIDGE_TEMP[] PROGMEM = "Fridge temp";
//static const char STR_FMT_SET_TO[] PROGMEM = "%S set to %s %S";

static const char STR_WEB_INTERFACE[]  = "in web interface";
static const char STR_TEMPERATURE_PROFILE[]  = "by temperature profile";
static const char STR_MODE[]  = "Mode";
static const char STR_BEER_TEMP[]  = "Beer temp";
static const char STR_FRIDGE_TEMP[]  = "Fridge temp";
static const char STR_FMT_SET_TO[]  = "%S set to %s %S";


void PiLink::setMode(const char* val) {
	char mode = val[0];
	tempControl.setMode(mode);
#if defined(ESP8266) || defined(ESP32)
	String annotation = "";
	formatStandardAnnotation(annotation, STR_MODE, val, "in web interface");
	printTemperaturesJSON(0, annotation.c_str());
#else
	piLink.printFridgeAnnotation(STR_FMT_SET_TO, STR_MODE, val, STR_WEB_INTERFACE);
#endif
}

/**
 * Set the target beer temperature
 * @param val - New temp value
 */
void PiLink::setBeerSetting(const char* val) {
#if defined(ESP8266) || defined(ESP32)
	String annotation = "";
#endif
	const char* source = NULL;
	temperature newTemp = stringToTemp(val);
	if (tempControl.cs.mode == 'p') {
		if (abs(newTemp - tempControl.cs.beerSetting) > 100) { // this excludes gradual updates under 0.2 degrees
#if defined(ESP8266) || defined(ESP32)
			formatStandardAnnotation(annotation, STR_BEER_TEMP, val, "by temperature profile");
#else
			source = STR_TEMPERATURE_PROFILE;
#endif
		}
	} else {
#if defined(ESP8266) || defined(ESP32)
		formatStandardAnnotation(annotation, STR_BEER_TEMP, val, "in web interface");
#else
		source = STR_WEB_INTERFACE;
#endif
	}
#if defined(ESP8266) || defined(ESP32)
	if (annotation.length() > 0)
		printTemperaturesJSON(annotation.c_str(), 0);
#else
	if (source)
		printBeerAnnotation(STR_FMT_SET_TO, STR_BEER_TEMP, val, source);
#endif
	tempControl.setBeerTemp(newTemp);		
}

//There's some kind of strange bug with the ESP8266 (probably a memory issue) where if I pass STR_WEB_INTERFACE
//as str_3, everything dies. Same with using "printFridgeAnnotation" - Everything dies. 
#if defined(ESP8266) || defined(ESP32)
void formatStandardAnnotation(String &annotation, const char* str_1, const char* str_2, const char* str_3) {
	annotation += str_1;
	annotation += " set to ";
	annotation += str_2;
	annotation += " ";
	annotation += str_3;
}
#endif


void PiLink::setFridgeSetting(const char* val) {
	temperature newTemp = stringToTemp(val);
	if(tempControl.cs.mode == 'f'){
#if defined(ESP8266) || defined(ESP32)
		String annotation = "";
		formatStandardAnnotation(annotation, STR_FRIDGE_TEMP, val, "in web interface");
		printTemperaturesJSON(0, annotation.c_str());
#else
		printFridgeAnnotation(STR_FMT_SET_TO, STR_FRIDGE_TEMP, val, STR_WEB_INTERFACE);
#endif
	}
	tempControl.setFridgeTemp(newTemp);	
}

void PiLink::setTempFormat(const char* val) {
	tempControl.cc.tempFormat = val[0];
	display.printStationaryText(); // reprint stationary text to update to right degree unit
	eepromManager.storeTempConstantsAndSettings();
}


// todo - move these structs to PROGMEM.
enum FilterType { FAST, SLOW, SLOPE };
enum TempSensorTarget { FRIDGE, BEER };

static uint8_t* const filterSettings[] = {
		&tempControl.cc.fridgeFastFilter,
		&tempControl.cc.fridgeSlowFilter,
		&tempControl.cc.fridgeSlopeFilter,
		&tempControl.cc.beerFastFilter,
		&tempControl.cc.beerSlowFilter,
		&tempControl.cc.beerSlopeFilter		
	};
	
#define MAKE_FILTER_SETTING_TARGET(filterType, sensorTarget)  (void*)(uint8_t(filterType)+uint8_t(sensorTarget)*3)

